const facts = [
  
    {
      "img": "https://avatars.githubusercontent.com/u/50206778?s=200&v=4",
      "text": "Если кто-то из вас когда-то жаловался, что Airtable платный. То я нашел для вас Nocodb, обязательно погуглите!"
    },

    {
        "img": "https://deusnotam.github.io/site/img/logo.jpeg",
        "text": "Боитесь, что заказчик не оплатит? А может хотите защитится от этого на всякий случай? Тогда обязательно загляни в проект DEUS."
    },

    {
      "img": "main/img/facts/music.gif",
      "text": "А вы знали, что по сайту можно путешествовать с приятной музыкой? Просто кликни по иконке с волной 😉"
  },
];
