const projects = [
  
    {
      "id": 0,
      "title": "DEUS",
      "img": "main/projects/DEUS/avatar.png",
      "overlay": "main/projects/DEUS/overlay.png",
      "outline": "#00ff00",
      "content-ru":
        [
          {"h4-super": "DEUS - защита контента"},
          {"img-super": "main/projects/DEUS/pic1.jpeg"},
          {"p-title": "Прежде чем рассказать о истории проекта и его создании, давайте посмотрим что это."},
          {"p-title": "DEUS - система-библиотека для удалённого контроля принадлежащих ей модулей."},
          {"p-title": "Простыми словами это система, которая подключается к сайту и следует определенным правилам, которые ей передают сами пользователи."},
          {"p-title": "Модуль BD - это системный модуль, он отвечает за проверку правил для сайта и подключение остальных модулей. На момент разработки являлся главным модулем системы и визуальную часть не имел."},
          {"img-super": "main/projects/DEUS/pic2.jpeg"},
          {"p-title": "Модуль ADS - это рекламный модуль. Он время от времени появляется на сайте в подвале. Таким образом реализовано бесплатное пользование системой взамен на показ рекламы от партнёров."},
          {"img-super": "main/projects/DEUS/pic3.jpeg"},
          {"p-title": "Модуль Noti - это модуль уведомлений. Основная цель создания модуля это информационный контакт с пользователем. Текст для уведомления можно редактировать и таким образом можно информировать пользователей о временных технических работах, блокировке сайта и т.п."},
          {"img-super": "main/projects/DEUS/pic4.jpeg"},
          {"p-title": "Модуль Blocker - это модуль отвечающий за наказания. Данный модуль применяется в случаях когда заказчик не оплатил работу и сменил все доступы так, что вы остались без денег и ваш труд отдан за бесплатно. В этом случае в работу вступает этот модуль применяя выбранный вами эффект к проекту."},
          {"img-super": "main/projects/DEUS/pic5.jpeg"},
          {"p-title": "Данный проект разрабатывался для личных целей, но со временем другие видя его в действии начали просить подключить и им тоже. Как итог теперь вы видите это творение."},
          {"p-title": "Альфа версия (когда проект был только для меня) находилась непосредственно в проекте, что немного затрудняло работу с ним напрямую. Но так как это было только для личного использования - меня устраивало."},
          {"img-super": "main/projects/DEUS/pic1.jpeg"},
          {"p-title": "Как только этот проект пошёл по знакомым было решено переписать структуру, логику и принцип работы полностью. Ведь большинство тех, кто этим пользовался никогда не работал с кодом."},
          {"p-title": "Первым лучшим решением было - раделение системы на модули. Из базы данных проверяется какие модули подключены к сайту и подгружает их. Сделано это для удобства управления и конечно же для того, чтобы значительно снизить нагрузку на сайт."},
          {"img-super": "main/projects/DEUS/avatar.jpeg"},
          {"p-title": "Вторым решением было упростить жизнь пользователям, вместо того чтобы поражаться тому какой огромный код им надо куда-то копировать, вся система была реализована как подключаемая библиотека."},
          {"img-super": "main/projects/DEUS/avatar.jpeg"},
          {"p-title": "И последним, но не менее важным решением было сделать открытый исходный код. Да, всю систему можно с лёгкостью найти на GitHub. И каждый может изменить её под свои нужды."},
        ],
      "hash": "deus",
      "url": "https://deusnotam.github.io"
    },
                              
  ];
